สรุปผลการทดลอง

  จากการทดลองเรื่องชนิดข้อมูลพื้นฐานบน ESP32 ได้เรียนรู้ว่าชนิดข้อมูลแต่ละประเภทมีขนาด, ขอบเขต และรูปแบบการใช้งานที่แตกต่างกัน เช่น int ใช้เก็บจำนวนเต็มทั่วไป, float และ double ใช้เก็บค่าทศนิยม, 
char ใช้เก็บอักขระ, bool ใช้เก็บค่าความจริง, long long และ unsigned ใช้เก็บตัวเลขที่มีขนาดใหญ่ขึ้น, ส่วน byte เหมาะกับข้อมูลขนาดเล็ก (0-255)
  นอกจากนี้ ยังได้ทดลองกับ sizeof() เพื่อดูขนาดของแต่ละชนิด และทดสอบการเกิด Overflow / Underflow, การแปลงชนิดข้อมูล (Type Casting) และผลจากการคำนวณข้ามชนิดข้อมูล ซึ่งล้วนมีผลต่อความถูกต้องและประสิทธิภาพของโปรแกรม

คำถามท้ายการทดลอง

1.นักศึกษาได้เรียนรู้อะไรบ้างเกี่ยวกับความแตกต่างและคุณสมบัติของชนิดข้อมูลแต่ละประเภทบน ESP32 (เช่น int, float, char, bool, long, long long, unsigned int, byte, double)
- เรียนรู้ว่าชนิดข้อมูลมีขนาด (จำนวนไบต์), ขอบเขตของค่าที่เก็บได้ และหน้าที่ที่ต่างกัน
- int, long, long long เก็บจำนวนเต็มในขอบเขตต่างกัน
- float, double ใช้เก็บค่าทศนิยม แต่ double มีความแม่นยำสูงกว่า
- char เก็บตัวอักษรแต่แท้จริงเป็นเลข ASCII
- bool ใช้เก็บค่า true/false
- byte เหมาะกับข้อมูลขนาดเล็ก 0–255

2.ความสำคัญของการเลือกใช้ชนิดข้อมูลที่เหมาะสมในการเขียนโปรแกรมคืออะไร?
- เพื่อประหยัดหน่วยความจำ ป้องกันข้อผิดพลาด เช่น Overflow หรือค่าคลาดเคลื่อน ทำให้โปรแกรมทำงานได้เร็วและมีประสิทธิภาพ
ส่งผลต่อความถูกต้องของข้อมูล โดยเฉพาะในการคำนวณหรือเก็บค่าจำนวนมาก

3.ถ้านักศึกษาต้องการเก็บค่าเวลา (เป็นมิลลิวินาที) ซึ่งอาจมีค่าสูงถึงหลายพันล้านมิลลิวินาที นักศึกษาควรใช้ชนิดข้อมูลใดบน ESP32
- ควรใช้ unsigned long (32 บิต) หรือหากต้องเก็บเวลานานกว่านั้น ให้ใช้ unsigned long long (64 บิต)

4.อธิบายความแตกต่างระหว่าง float และ double ในแง่ของขนาดหน่วยความจำและความแม่นยำ
- ขนาดหน่วยความจำ float 4 ไบต์ (32 บิต) ความแม่นยำ	float ~6-7 หลักทศนิยม 
- ขนาดหน่วยความจำ double 8 ไบต์ (64 บิต) ความแม่นยำ double ~15-16 หลักทศนิยม

5.อธิบายแนวคิดเรื่อง "Overflow" และ "Underflow" ที่เกิดขึ้นกับชนิดข้อมูลจำนวนเต็ม (เช่น int, byte) พร้อมยกตัวอย่างจากใบงานนี้
- Overflow: เกิดเมื่อค่าที่เก็บ เกินขอบเขตสูงสุด ของชนิดข้อมูล เช่น int myInt = 2147483647 + 1; → ค่ากลายเป็น -2147483648 (วนกลับด้านล่าง)
- Underflow: เกิดเมื่อค่าที่เก็บ ต่ำกว่าขอบเขตต่ำสุด เช่น byte myByte = 0 - 1; → ได้ค่าเป็น 255 (เพราะ byte วนจาก 0 → 255)

6.การทราบขนาดของชนิดข้อมูลด้วย sizeof() มีประโยชน์อย่างไรในการเขียนโปรแกรมสำหรับไมโครคอนโทรลเลอร์ที่มีหน่วยความจำจำกัด?
- ช่วยให้รู้ว่าแต่ละชนิดใช้หน่วยความจำเท่าไร ทำให้เลือกชนิดข้อมูลได้เหมาะกับขนาดข้อมูลจริง ไม่เปลืองพื้นที่
ป้องกันการใช้ชนิดข้อมูลเกินความจำเป็นในระบบที่มี RAM น้อย ส่งผลให้โปรแกรมมีขนาดเล็กและทำงานเร็วขึ้น
